Repository: DeAngelisDavide/yourtrip
Catalog: lib/l10n/intl_*.arb
Languages: ar, de, fr, pt, zh

# homeAppBar
source: Your trips
ar: رحلاتك
de: Ihre Reisen
fr: Vos voyages
pt: Suas viagens
zh: 你的旅行

# statsAppBar
source: Your stats
ar: إحصائياتك
de: Deine Statistiken
fr: Vos statistiques
pt: As tuas estatísticas
zh: 您的统计数据

# memoriesAppBar
source: Your memories
ar: ذكرياتك
de: Deine Erinnerungen
fr: Vos souvenirs
pt: As tuas memórias
zh: 你的回忆

# settingsAppBar
source: Settings
ar: إعدادات
de: Einstellungen
fr: Paramètres
pt: Configurações
zh: 设置

# createAppBar
source: Configure your trip
ar: جهز رحلتك الخاصة
de: Gestalten Sie Ihre Reise
fr: Configurez votre propre voyage
pt: Configure sua própria jornada
zh: 设置自己的旅程

source: Total cost
ar: مجموع التكاليف
de: Gesamtkosten
fr: Coût total
pt: Configure a sua viagem
zh: 总费用

# costSpecifically
source: Costs specifically
ar: تكاليف محددة
de: Kosten im Einzelnen
fr: Costi nello specifico
pt: Custos específicos
zh: 具体费用

source: Select your currency
ar: حدد عملتك
de: Wählen Sie Ihre Währung aus
fr: Coûts spécifiques
pt: Selecione sua moeda
zh: 选择您的货币

source: Trip
ar: رحلة
de: Reise
fr: Voyage
pt: Viagem
zh: 旅途之旅

source: Budget
ar: ميزانية
zh: 四.预算

source: Trip name
ar: اسم الرحلة
de: Name der reise
fr: Nom du voyage
pt: Nome da viagem
zh: 行程名称

source: Transport cost
ar: تكاليف النقل
de: Transportkosten
fr: Coûts de transport
pt: Custos de transporte
zh: 运输费用

source: Accommodation cost
ar: تكاليف الإقامة
de: Kosten für die Unterkunft
fr: Frais d'hébergement
pt: Custos de alojamento
zh: 住宿费用

source: Other cost
ar: تكاليف أخرى
de: Sonstige Aufwendungen
fr: Autres coûts
pt: Outros custos
zh: 其他费用

# uploadPhoto
source: Upload a photo
ar: قم بتحميل صورة
de: Lade ein Foto
fr: Chargez une photo
pt: Carregar uma foto
zh: 上传照片

# insertTitle
source: Insert the title
ar: أدخل العنوان
de: Geben Sie den titel
fr: Entrez le titre
pt: Insira o título
zh: 输入标题

source: Confirm
ar: تأكيد
de: Bestätigung
fr: Confirme
pt: Confirmação
zh: 输入标题

# statsNavbar
source: My stats
ar: إحصائيات
de: Statistiken
fr: Statistiques
pt: Estatísticas
zh: 统计数字

# memoriesNavbar
source: Memories
ar: ذكريات
de: Erinnerungen
fr: Souvenirs
pt: Memórias
zh: 记忆,

# chageLeanguages
source: Change your language
ar: تغيير اللغة
de: Ändern sie die sprache
fr: Changer la langue
pt: Alterar o idioma
zh: 改变语言

# moreExpensive
source: More expensive trip
ar: أغلى رحلة
de: Die teuerste reise
fr: Le voyage le plus cher
pt: A viagem mais cara
zh: 最贵的一趟

# lessExpensive
source: Less expensive trip
ar: أرخص رحلة
de: Die günstigste reise
fr: Le voyage le moins cher
pt: A viagem mais barata
zh: 最便宜的旅行

# addTrip
source: Add a trip for more statistics
ar: أضف رحلة لمزيد من الإحصائيات
de: Fügen sie eine reise für weitere statistiken hinzu
fr: Ajouter un voyage pour plus de statistiques
pt: Adicione uma viagem para mais estatísticas
zh: 添加行程以获取更多统计信息

# addMemories
source: No image added to trips
ar: لا توجد صورة مضافة للسفر
de: Keine Bilder zu Reisen hinzugefügt
fr: Aucune image ajoutée aux voyages
pt: Nenhuma imagem adicionada à viagem
zh: 没有添加到旅行中的图像

source: Delete
ar: احذف
de: Löschen
fr: Èlimine
pt: Elimina
zh: 淘汰,

# formatImage
source: Only png,jpg,jpeg formats are accepted
ar: يتم قبول تنسيقات png و jpg و jpeg فقط
de: Es werden nur die Formate png, jpg, jpeg akzeptiert
fr: Seuls les formats png,jpg,jpeg sont acceptés
pt: Somente formatos png, jpg, jpeg são aceitos
zh: 只接受png、jpg、jpeg格式
